<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CitiesSeeder extends Seeder
{
    public function run(): void
    {
        $cities = [
            'თბილისი', 'ბათუმი', 'რუსთავი', 'ქუთაისი', 'გორი', 'ფოთი', 'ზუგდიდი', 
            'მარნეული', 'ხაშური', 'სამტრედია', 'ზესტაფონი', 'თელავი', 'ქობულეთი', 
            'ახალციხე', 'სენაკი', 'ოზურგეთი', 'კასპი', 'ჭიათურა', 'გარდაბანი', 
            'ბორჯომი', 'საგარეჯო', 'ყვარელი', 'ბოლნისი', 'ტყიბული', 'ხონი', 
            'წყალტუბო', 'ახალქალაქი', 'მცხეთა', 'გურჯაანი', 'დუშეთი', 'ქარელი', 
            'ლანჩხუთი', 'ახმეტა', 'ლაგოდეხი', 'საჩხერე', 'დედოფლისწყარო', 'ვალე', 
            'თერჯოლა', 'წნორი', 'თეთრიწყარო', 'აბაშა', 'მარტვილი', 'ნინოწმინდა', 
            'წალკა', 'ვანი', 'ხობი', 'დმანისი', 'წალენჯიხა', 'ბაღდათი', 'ონი', 
            'ჩხოროწყუ', 'ამბროლაური', 'სიღნაღი', 'ჯვარი', 'ცაგერი'
        ];

        foreach ($cities as $city) {
            DB::table('cities')->insert([
                'country_id' => 1,
                'name' => $city,
                'is_active' => 1,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}